routes/web.php

|
*/

Route::get('/', function () {
    $date = Carbon::now()->subDay()->startOfDay();

    return Inertia::render("index", [
        'contrats' => Contrat::where("type_paiement", "!=", "Credit")->where("created_at", ">=", $date)->get(),
        'charges' => Charge::where("created_at", ">=", $date)->get(),
        'resiliations' => Resiliation::where("created_at", ">=", $date)->get(),
        'paiements' => PaiementCredit::where("created_at", ">=", $date)->get()
    ]);
})->middleware("auth")->name("index");
---
select * from `contrats`
select * from `contrats` where `type_paiement` != 'Credit' and `created_at` >= '2021-06-20 00:00:00'
select * from `charges` where `created_at` >= '2021-06-20 00:00:00'
select * from `resiliations` where `created_at` >= '2021-06-20 00:00:00'
select * from `paiement_credits` where `created_at` >= '2021-06-20 00:00:00'