app/Http/Controllers/ChargeController.php

    public function index()
    {
        return Inertia::render("GestionCharges/Index", [
            "charges" => Charge::all()
        ]);
---
select * from `charges`

    public function destroy(Charge $charge)
    {
        $charge->delete();
---
delete from `charges` where `id` = 49