app/Http/Controllers/ClientController.php

select * from `clients` limit 10 offset 0
select count(*) as aggregate from `clients`
---
    public function index()
    {
        return Inertia::render("GestionClient/Index", [
            "clients" => fn () => Client::query()->when(request()->search, function ($query, $search) {
                return
                    $query->where("nom", "like", '%' . $search . '%')
                        ->orWhere("cin", "like", '%' . $search . '%')
                        ->orWhere("tele", "like", '%' . $search . '%');
            })
            ->paginate(10),
        ]);

select * from `clients` where `id` = '61' limit 1
select * from `credits` where `credits`.`contrat_id` in (61)
select * from `vehicules` where `vehicules`.`client_id` in (61)
select `contrats`.*, `vehicules`.`client_id` as `laravel_through_key` from `contrats` inner join `vehicules` on `vehicules`.`id` = `contrats`.`vehicule_id` where `vehicules`.`client_id` in (61)
---
    public function show($client_id)
    {
        $client = Client::query()->where("id", $client_id)
            ->with(["vehicules", "contrats.vehicule", "contrats.credit.paiements"])
            ->firstOrFail();