app/Http/Controllers/CreditController.php

    public function index()
    {
        return Inertia::render("Credit/Index", [
            "credits" => fn () => Credit::with(["contrat.vehicule.client", "paiements"])
                ->when(request()->search, function (Builder $query, $search) {
                    return $query->whereHas("contrat.vehicule.client", function (Builder $query) use ($search) {
                        $query->where("nom", "like", '%' . $search . '%')
                            ->orWhere("cin", "like", '%' . $search . '%');
                    });
                })
                ->when(request()->has("completed"), function (Builder $query) {
                    return $query->where("completed", "!=", null);
                })
                ->get()
        ]);
---
select * from `clients` where `clients`.`id` in (14, 18, 23, 40, 61, 62, 68, 72, 87, 99)
select * from `contrats` where `contrats`.`id` in (14, 18, 23, 40, 61, 62, 68, 72, 87, 99)
select * from `credits` where `completed` is not null
select * from `vehicules` where `vehicules`.`id` in (14, 18, 23, 40, 61, 62, 68, 72, 87, 99)

    public function show($credit_id)
    {
        $credit = Credit::query()->where("id", $credit_id)
            ->with(["paiements", "contrat.vehicule"])
            ->firstOrFail();
---
select * from `contrats` where `contrats`.`id` in (72)
select * from `credits` where `id` = '8' limit 1
select * from `vehicules` where `vehicules`.`id` in (72)