app/Http/Controllers/ResiliationController.php

select * from `clients` where `clients`.`id` in (1, 6, 7, 14, 18, 20, 21, 23, 33, 34, 40, 43, 52, 74, 87, 97)
select * from `contrats` where `contrats`.`id` in (1, 6, 7, 14, 18, 20, 21, 23, 33, 34, 40, 43, 52, 74, 87, 97)
select * from `resiliations`
select * from `vehicules` where `vehicules`.`id` in (1, 6, 7, 14, 18, 20, 21, 23, 33, 34, 40, 43, 52, 74, 87, 97)
---
    public function index()
    {
        return Inertia::render("Resiliation/Index", [
            "resiliations" => fn () => Resiliation::with(["contrat.vehicule.client"])
                ->when(request()->search, function (Builder $query, $search) {
                    return $query->whereHas("contrat.vehicule.client", function (Builder $query) use ($search) {
                        $query->where("nom", "like", '%' . $search . '%')
                            ->orWhere("cin", "like", '%' . $search . '%');
                    });
                })
                ->get()
        ]);

select * from `contrats` where `contrats`.`id` = 61 limit 1
update `contrats` set `is_active` = 0, `contrats`.`updated_at` = '2021-06-21 02:57:18' where `id` = 61
update `credits` set `completed` = '2021-06-21 02:57:18', `credits`.`updated_at` = '2021-06-21 02:57:19' where `id` = 5
---
    public function store(Request $request)
    {
        $request->validate([
            'montant' => ["required", "numeric"],
            'montant_total' => ["sometimes", "required", "numeric"],
            'contrat_id' => ["required", "numeric", "exists:contrats,id"]
        ]);

        $contrat = Contrat::query()->findOrFail($request->contrat_id);

        DB::transaction(function () use ($request, $contrat) {
            $contrat->update([
                "is_active" => false,
            ]);

            $contrat->credit?->update([
                "completed" => now()
            ]);

select * from `clients` where `clients`.`id` = 61 limit 1
---
            }
        });

        return redirect()->route("gestion-clients.show", $contrat->client)
            ->with("message", "succès");